import { Typography } from 'antd';
import styles from './DetailsInfo.module.css';
import { useState } from 'react';
const { Paragraph } = Typography;



export const DetailsInfo = () => {
    const [ellipsis, setEllipsis] = useState(true);
    return (
     
          <div className={styles.infoDetails}>
      
            <Paragraph
              ellipsis={
                ellipsis
                  ? {
                      rows: 5,
                     
                     
                    }
                  : false
              }
            >
                
             <h4>DIXI - інтернет магазин взуття в Україні</h4>
Створити функціональний, стильний і завершений образ без грамотно підібраного взуття та аксесуарів неможливо - це підтвердить 
не лише будь-який стиліст, але і сучасна дівчина. Якщо кілька десятків років вважалося, що все гарне неодмінно має приносити 
дискомфорт, а жінки дотримувалися популярного «краса вимагає жертв», то дійсність, на щастя, кардинально змінилася. Жіноче взуття 
покликане дарувати комфорт і легку ходу, не приносячи на модний вівтар жертву у вигляді набряків, втоми, деформування 
стопи та іншого. Сучасна мода пропонує безліч рішень, як круто включити практично будь-яку модель взуття в той чи інший аутфіт 
будь то на кожен день, для подорожей, офісних буднів, світських заходів, урочистостей. Міратон - інтернет магазин взуття, який Київ 
вибирає за широкий асортимент брендових товарів високої якості, що відповідають останнім тенденціям світових подіумів. Якщо вам 
потрібне виразне, стильне жіноче взуття, Україна, інтернет-магазин Miraton пропонують робити вдалі покупки онлайн і отримувати 
знижки та приємні бонуси.
<h4>ЧОМУ ВАРТО ПРИДБАТИ БРЕНДОВЕ ВЗУТТЯ В ІНТЕРНЕТ МАГАЗИНІ DIXI</h4>
Компанія «Міратон» працює на ринку модної індустрії більше 10 років! У 2019 мережа магазинів завоювала перше місце в рейтинговому 
голосуванні Української народної премії серед магазинів одягу і взуття. Пропонує наш інтернет магазин взуття в Україні популярних 
торгових марок Італії, Іспанії, Португалії, США, що використовують на виробництві якісні, стійкі до зносу комплектуючі та фурнітуру.
 Наш інтернет магазин брендового взуття пропонує трендові новинки, які встигли полюбитися модницям світових столиць, а також базові 
 моделі - бестселери, не підвладні віянням моди. Співпрацюємо з дизайнерами провідних світових агентств по розробці унікальних 
 фасонів для власних торгових марок. Також відбираємо кращі моделі на спеціалізованих виставках в Мілані, Мадриді, Нью-Йорку, 
 Дюссельдорфі. Керуємося політикою демократичних цін, щоб українські fashionista могли купити брендове взуття в інтернет магазині, 
 класну обновку за доступною вартістю.
 <h4>ВЗУТТЄВИЙ МАГАЗИН, ЯКИЙ ДУМАЄ ПРО СВОЇХ ПОКУПЦІВ</h4>
Рішення купити взуття в інтернет магазині Miraton обернеться вигідною інвестицією в гардероб! Нова пара прослужить не один сезон
 поспіль без втрати своїх первісних якісних характеристик. Наш інтернет магазин жіночого взуття пропонує:
<ol>
    <li>Зимове взуття: чоботи, черевики, уггі. Кожна пара має стильний дизайн, стійка до морозів, промокання, допоможе встояти 
        на слизьких поверхнях.</li>
        <li>Демісезонне: ботфорти, ботильйони, чоботи, черевики. Різноманітність моделей, фасонів дозволить підібрати пару 
            на будь-який смак і спосіб життя. Натуральна шкіра, замша, креативний декор і надійна фурнітура роблять бажаною 
            будь-яку модель.</li>
            <li>Туфлі: балетки, човники, лофери, оксфорди, сліпери, мокасини, сліпони, еспадрільі. Зручні колодки, приємні на дотик 
                матеріали, міцні і в міру гнучкі підошви гарантують комфорт своєї власниці протягом усього дня.</li>
                <li>Моделі для літа: босоніжки, шльопанці, сандалі, сабо. Різноманітність підошов, форм каблуків, квітів, принтів, 
                    декору, матеріалів дозволить легко підібрати заповітну обновку і зустріти літо модними луками.</li>
                    <li>Кеди і кросівки. Вас чекають моделі спеціалізованих брендів для спорту, активного відпочинку, щоденного 
                        використання, утеплені хутром для холодів.</li>
</ol>
<h4>DIXI - ІНТЕРНЕТ МАГАЗИН ВЗУТТЯ: УКРАЇНА ДОВІРЯЄ КРАЩИМ</h4>
Шопінг - для багатьох процес захоплюючий і приємний, проте до тих пір, поки не стає виснажливим. Якщо ви робите покупки онлайн, 
то позбавляєте себе черг в примірочні або на касу, нагнітаючого скупчення людей, економите час і нерви! Міратон сайт взуття, 
Україна вибирає не тільки за високу якість товарів за демократичною ціною, але також за чуйний сервіс. Якщо ви не впевнені 
в розмірі пари, що підбираєте, замовте додаткову, щоб примірявши при отриманні, залишити ту, що підходить. Зрозуміла навігація 
по сайту дозволяє оформити замовлення в кілька кліків, не відволікаючись від звичних справ. Реальні фото допоможуть детально 
розглянути бажану обновку. Якщо все ж виникли питання - телефонуйте на гарячу лінію інтернет-магазину, кваліфіковані 
онлайн-консультанти дадуть відповідь на всі питання, які цікавлять щодо покупки.
            </Paragraph>
      <div className={styles.blockMore}> 
       
          <span className={styles.seeMore} onClick={() => setEllipsis(!ellipsis)}>{ellipsis ? 'Розгорнути' : 'Згорнути'}</span>
        
          </div>
          </div>
  );
}




export default DetailsInfo;
